IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_clb_xbar_regs.xml
<module id="CLB_XBAR_REGS" HW_revision="" description="CLB XBAR Registers">
	<register id="AUXSIG0MUX0TO15CFG" width="32" page="1" offset="0x0" internal="0" description="CLB XBAR Mux Configuration for Output-0">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG0 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG0 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG0 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG0 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG0 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG0 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG0 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG0 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG0 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG0 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG0 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG0 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG0 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG0 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG0 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG0 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG0MUX16TO31CFG" width="32" page="1" offset="0x2" internal="0" description="CLB XBAR Mux Configuration for Output-0">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG0 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG0 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG0 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG0 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG0 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG0 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG0 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG0 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG0 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG0 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG0 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG0 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG0 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG0 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG0 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG0 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG1MUX0TO15CFG" width="32" page="1" offset="0x4" internal="0" description="CLB XBAR Mux Configuration for Output-1">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG1 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG1 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG1 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG1 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG1 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG1 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG1 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG1 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG1 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG1 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG1 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG1 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG1 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG1 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG1 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG1 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG1MUX16TO31CFG" width="32" page="1" offset="0x6" internal="0" description="CLB XBAR Mux Configuration for Output-1">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG1 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG1 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG1 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG1 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG1 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG1 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG1 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG1 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG1 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG1 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG1 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG1 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG1 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG1 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG1 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG1 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG2MUX0TO15CFG" width="32" page="1" offset="0x8" internal="0" description="CLB XBAR Mux Configuration for Output-2">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG2 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG2 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG2 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG2 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG2 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG2 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG2 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG2 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG2 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG2 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG2 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG2 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG2 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG2 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG2 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG2 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG2MUX16TO31CFG" width="32" page="1" offset="0xa" internal="0" description="CLB XBAR Mux Configuration for Output-2 ">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG2 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG2 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG2 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG2 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG2 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG2 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG2 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG2 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG2 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG2 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG2 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG2 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG2 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG2 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG2 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG2 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG3MUX0TO15CFG" width="32" page="1" offset="0xc" internal="0" description="CLB XBAR Mux Configuration for Output-3">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG3 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG3 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG3 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG3 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG3 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG3 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG3 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG3 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG3 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG3 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG3 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG3 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG3 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG3 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG3 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG3 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG3MUX16TO31CFG" width="32" page="1" offset="0xe" internal="0" description="CLB XBAR Mux Configuration for Output-3">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG3 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG3 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG3 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG3 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG3 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG3 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG3 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG3 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG3 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG3 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG3 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG3 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG3 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG3 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG3 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG3 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG4MUX0TO15CFG" width="32" page="1" offset="0x10" internal="0" description="CLB XBAR Mux Configuration for Output-4">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG4 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG4 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG4 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG4 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG4 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG4 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG4 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG4 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG4 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG4 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG4 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG4 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG4 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG4 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG4 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG4 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
