IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_clb_xbar_regs.xml
	<register id="AUXSIG6MUX0TO15CFG" width="32" page="1" offset="0x18" internal="0" description="CLB XBAR Mux Configuration for Output-6">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG6 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG6 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG6 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG6 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG6 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG6 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG6 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG6 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG6 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG6 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG6 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG6 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG6 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG6 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG6 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG6 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG6MUX16TO31CFG" width="32" page="1" offset="0x1a" internal="0" description="CLB XBAR Mux Configuration for Output-6">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG6 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG6 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG6 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG6 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG6 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG6 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG6 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG6 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG6 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG6 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG6 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG6 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG6 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG6 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG6 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG6 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG7MUX0TO15CFG" width="32" page="1" offset="0x1c" internal="0" description="CLB XBAR Mux Configuration for Output-7">
		<bitfield id="MUX0" description="MUX0 Configuration for AUXSIG7 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for AUXSIG7 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for AUXSIG7 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for AUXSIG7 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for AUXSIG7 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for AUXSIG7 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for AUXSIG7 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for AUXSIG7 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for AUXSIG7 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for AUXSIG7 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for AUXSIG7 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for AUXSIG7 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for AUXSIG7 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for AUXSIG7 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for AUXSIG7 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for AUXSIG7 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG7MUX16TO31CFG" width="32" page="1" offset="0x1e" internal="0" description="CLB XBAR Mux Configuration for Output-7">
		<bitfield id="MUX16" description="MUX16 Configuration for AUXSIG7 of CLB-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for AUXSIG7 of CLB-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for AUXSIG7 of CLB-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for AUXSIG7 of CLB-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for AUXSIG7 of CLB-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for AUXSIG7 of CLB-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for AUXSIG7 of CLB-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for AUXSIG7 of CLB-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for AUXSIG7 of CLB-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for AUXSIG7 of CLB-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for AUXSIG7 of CLB-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for AUXSIG7 of CLB-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for AUXSIG7 of CLB-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for AUXSIG7 of CLB-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for AUXSIG7 of CLB-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for AUXSIG7 of CLB-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="AUXSIG0MUXENABLE" width="32" page="1" offset="0x20" internal="0" description="CLB XBAR Mux Enable Register for Output-0">
		<bitfield id="MUX0" description="mux0 to drive AUXSIG0 of CLB-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 to drive AUXSIG0 of CLB-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 to drive AUXSIG0 of CLB-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 to drive AUXSIG0 of CLB-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 to drive AUXSIG0 of CLB-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 to drive AUXSIG0 of CLB-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 to drive AUXSIG0 of CLB-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 to drive AUXSIG0 of CLB-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 to drive AUXSIG0 of CLB-XBAR" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 to drive AUXSIG0 of CLB-XBAR" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 to drive AUXSIG0 of CLB-XBAR" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 to drive AUXSIG0 of CLB-XBAR" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 to drive AUXSIG0 of CLB-XBAR" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 to drive AUXSIG0 of CLB-XBAR" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 to drive AUXSIG0 of CLB-XBAR" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 to drive AUXSIG0 of CLB-XBAR" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MUX16" description="MUX16 to drive AUXSIG0 of CLB-XBAR" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 to drive AUXSIG0 of CLB-XBAR" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 to drive AUXSIG0 of CLB-XBAR" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 to drive AUXSIG0 of CLB-XBAR" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 to drive AUXSIG0 of CLB-XBAR" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 to drive AUXSIG0 of CLB-XBAR" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 to drive AUXSIG0 of CLB-XBAR" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 to drive AUXSIG0 of CLB-XBAR" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 to drive AUXSIG0 of CLB-XBAR" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 to drive AUXSIG0 of CLB-XBAR" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 to drive AUXSIG0 of CLB-XBAR" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 to drive AUXSIG0 of CLB-XBAR" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 to drive AUXSIG0 of CLB-XBAR" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 to drive AUXSIG0 of CLB-XBAR" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 to drive AUXSIG0 of CLB-XBAR" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 to drive AUXSIG0 of CLB-XBAR" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
